Revit 2027 API
PanelScheduleData.UpdateCircuitTableForTemplate Method
 Redraw the circuit table for a template with the given parameter updates
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void UpdateCircuitTableForTemplate(
	PanelSchedulePhaseLoadType newType,
	int nNumSlots,
	bool bPhasesAsCurrents
)
Public Sub UpdateCircuitTableForTemplate (
	newType As PanelSchedulePhaseLoadType,
	nNumSlots As Integer,
	bPhasesAsCurrents As Boolean
)
public:
void UpdateCircuitTableForTemplate(
	PanelSchedulePhaseLoadType newType,
	int nNumSlots,
	bool bPhasesAsCurrents
)
member UpdateCircuitTableForTemplate :
        newType : PanelSchedulePhaseLoadType *
        nNumSlots : int *
        bPhasesAsCurrents : bool -> unit
Parameters
newType PanelSchedulePhaseLoadType
 The new phase load type of the circuit table
nNumSlots Int32
 The number of circuit slots
bPhasesAsCurrents Boolean
 True if the phase columns should be currents, false if they should be loads
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace